tap "homebrew/bundle"

#
# Formulae
#

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Improved top (interactive process viewer)
brew "htop"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"

#
# Casks
#

# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Nerd font
cask "font-fira-code"
# Nerd font with many icons
cask "font-fira-code-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Research management tool
cask "mendeley-reference-manager"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Plot geo-referenced data from netCDF, HDF, and GRIB
cask "panoply"
# Geographic Information System
cask "qgis"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Productivity application
cask "quicksilver"
# Environment for statistical computing and graphics
# Note: CRAN-built R (this cask) is needed for binary packages
cask "r"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# JDK from the Eclipse Foundation (Adoptium) [needed for Panoply]
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"

#
# VSCode extensions
#

# Show documentation in sidebar
vscode "bierner.docs-view"
# Code linter + formatter
vscode "charliermarsh.ruff"
# Colour theme
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
# Path autocompletion
vscode "ionutvmi.path-autocomplete"
# Python language extensions
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
# Jupyter language extensions
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
# R language extensions
vscode "quarto.quarto"
vscode "reditorsupport.r"
# TOML syntax highlighting
vscode "tamasfe.even-better-toml"
